src/cf/Documents/уатПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатПлатежноеПоручениеИсходящее</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаявкаНаРасходованиеДС</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.уатРемонтныйЛист</xr:Item>
				<xr:Item>Document.уатОтчетСистемыПлатон</xr:Item>
				<xr:Item>Document.уатШтраф</xr:Item>
				<xr:Item>Document.уатСчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.уатОтчетСистемыАвтодор</xr:Item>
				<xr:Item>Document.уатАвансовыйОтчет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатДвижениеДС</xr:Item>
				<xr:Item>AccumulationRegister.уатЗаявкиНаРасходованиеДС</xr:Item>
				<xr:Item>AccumulationRegister.уатОстаткиДСУПодотчетныхЛиц</xr:Item>
				<xr:Item>AccumulationRegister.уатОстаткиДС</xr:Item>
				<xr:Item>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.уатРасчетыПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Comment>Банковский счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>(Общ) электронно, почтой, телеграфом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>Дата входящего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатШтраф</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРасходованиеДС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОтчетСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Comment>Оплачено</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Comment>Приложение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Comment>Принято от</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Comment>Расчетный документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗаказов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>Сумма платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>Сумма взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Comment>Кратность взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>Курс взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>Статья движения денежных средств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПланированияПлатежа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаявкаНаРасходованиеДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>Сумма платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>Сумма взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийПлатежноеПоручениеИсходящее</Name>
			<Comment>Виды операций документа "Платежное поручение исходящее" (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатПлатежноеПоручениеИсходящее/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатПлатежноеПоручениеИсходящее";
	КомандаПечати.Идентификатор = "ПлатежноеПоручение";
	КомандаПечати.Представление = НСтр("en='Payment order';ru='Платежное поручение'");
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("en='Document register';ru='Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("en='Registry of document ""Outgoing payment order""';ru='Реестр документов ""Платежное поручение исходящее""'");
	КомандаПечати.Обработчик     = "уатОбщегоНазначенияТиповыеКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПлатежноеПоручение") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПлатежноеПоручение",
			"Платежное поручение", ПечатьППИсх(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	уатУправлениеПечатью.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Если НЕ ДокументСсылка.Оплачено Тогда
		Возврат;
	КонецЕсли;
		
	ВидОперации_Подотчетник = (ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику);
	ВидОперации_ПодотчетникИлиПрочее = (ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику
		ИЛИ ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.РасходДенежныхСредствПрочее);
	флЕстьВзаиморасчеты = (ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВозвратПокупателю
		ИЛИ ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику
		ИЛИ ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПрочиеРасчетыСКонтрагентами);
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Взаиморасчеты"" КАК ИмяРегистра,
	|	РасшифровкаПлатежаДок.Ссылка КАК Регистратор,
	|	РасшифровкаПлатежаДок.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	РасшифровкаПлатежаДок.Ссылка.Организация КАК Организация,
	|	РасшифровкаПлатежаДок.Ссылка.Контрагент КАК Контрагент,
	|	РасшифровкаПлатежаДок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
	|				ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|				ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|				ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС)
	|			ТОГДА РасшифровкаПлатежаДок.Сделка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Сделка,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов КАК Валюта,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаПлатежа КАК СуммаПлатежа,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	0 КАК СуммаУпр,
	|	РасшифровкаПлатежаДок.СтавкаНДС КАК СтавкаНДС,
	|	РасшифровкаПлатежаДок.СуммаНДС КАК СуммаНДС,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ КАК ДатаКурса
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка И НЕ &ВидОперации_ПодотчетникИлиПрочее
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ДвижениеДС"" КАК ИмяРегистра,
	|	РасшифровкаПлатежаДок.Ссылка КАК Регистратор,
	|	РасшифровкаПлатежаДок.Ссылка КАК ДокументДвижения,
	|	РасшифровкаПлатежаДок.Ссылка.Дата КАК Период,
	|	РасшифровкаПлатежаДок.Ссылка.БанковскийСчет КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.уатФормыОплаты.Безналичные) КАК ВидДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход) КАК ПриходРасход,
	|	РасшифровкаПлатежаДок.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА &ВидОперации_Подотчетник
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.ПодотчетноеЛицо
	|		ИНАЧЕ РасшифровкаПлатежаДок.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &ВидОперации_Подотчетник
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
	|				ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|				ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|				ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС)
	|			ТОГДА РасшифровкаПлатежаДок.Сделка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Сделка,
	|	РасшифровкаПлатежаДок.Ссылка.ВалютаДокумента КАК Валюта,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаПлатежа КАК Сумма,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	0 КАК СуммаУпр,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ КАК ДатаКурса
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ДвижениеДС"",
	|	РасшифровкаПлатежаДок.Ссылка,
	|	РасшифровкаПлатежаДок.Ссылка,
	|	РасшифровкаПлатежаДок.Ссылка.Дата,
	|	РасшифровкаПлатежаДок.Ссылка.СчетПолучателя,
	|	ЗНАЧЕНИЕ(Перечисление.уатФормыОплаты.Безналичные),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход),
	|	РасшифровкаПлатежаДок.Ссылка.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	РасшифровкаПлатежаДок.Ссылка.ВалютаДокумента КАК Валюта,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаПлатежа КАК Сумма,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	0,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка
	|	И РасшифровкаПлатежаДок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уатВидыОперацийПлатежноеПоручениеИсходящее.ПереводНаДругойСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ОстаткиДС"" КАК ИмяРегистра,
	|	РасшифровкаПлатежаДок.Ссылка КАК Регистратор,
	|	РасшифровкаПлатежаДок.Ссылка КАК ДокументДвижения,
	|	РасшифровкаПлатежаДок.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РасшифровкаПлатежаДок.Ссылка.Организация КАК Организация,
	|	РасшифровкаПлатежаДок.Ссылка.БанковскийСчет КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.уатФормыОплаты.Безналичные) КАК ВидДенежныхСредств,
	|	РасшифровкаПлатежаДок.Ссылка.ВалютаДокумента КАК Валюта,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаПлатежа КАК Сумма,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	0 КАК СуммаУпр,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ КАК ДатаКурса
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ОстаткиДС"",
	|	РасшифровкаПлатежаДок.Ссылка,
	|	РасшифровкаПлатежаДок.Ссылка,
	|	РасшифровкаПлатежаДок.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	РасшифровкаПлатежаДок.Ссылка.Организация,
	|	РасшифровкаПлатежаДок.Ссылка.СчетПолучателя,
	|	ЗНАЧЕНИЕ(Перечисление.уатФормыОплаты.Безналичные),
	|	РасшифровкаПлатежаДок.Ссылка.ВалютаДокумента,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаПлатежа,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов,
	|	0 КАК СуммаУпр,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка
	|	И РасшифровкаПлатежаДок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уатВидыОперацийПлатежноеПоручениеИсходящее.ПереводНаДругойСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ОстаткиДСуПодотчетныхЛиц"" КАК ИмяРегистра,
	|	РасшифровкаПлатежаДок.Ссылка КАК Регистратор,
	|	РасшифровкаПлатежаДок.Ссылка КАК ДокументДвижения,
	|	РасшифровкаПлатежаДок.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	РасшифровкаПлатежаДок.Ссылка.Организация КАК Организация,
	|	РасшифровкаПлатежаДок.Ссылка.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	РасшифровкаПлатежаДок.Ссылка.ВалютаДокумента КАК Валюта,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаПлатежа КАК Сумма,
	|	0 КАК СуммаУпр,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ КАК ДатаКурса
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ПлатежныйКалендарь"" КАК ИмяРегистра,
	|	РасшифровкаПлатежаДок.Ссылка КАК Регистратор,
	|	РасшифровкаПлатежаДок.Ссылка.Дата КАК Период,
	|	РасшифровкаПлатежаДок.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.НашаОрганизация) КАК ПолучательУслуг,
	|	РасшифровкаПлатежаДок.Ссылка.Контрагент КАК Контрагент,
	|	РасшифровкаПлатежаДок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС)
	|			ТОГДА РасшифровкаПлатежаДок.Сделка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаТС,
	|	РасшифровкаПлатежаДок.Сделка КАК Сделка,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов КАК Валюта,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов КАК СуммаРасход,
	|	РасшифровкаПлатежаДок.СуммаПлатежа КАК СуммаПлатежа,
	|	0 КАК СуммаРасходУпр,
	|	РасшифровкаПлатежаДок.ID КАК ID,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ КАК ДатаКурса
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка
	|	И НЕ &ВидОперации_ПодотчетникИлиПрочее
	|	И (РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
	|			ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|			ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ИЛИ РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасшифровкаПлатежаДок.Ссылка КАК Регистратор,
	|	РасшифровкаПлатежаДок.Ссылка КАК ДокументДвижения,
	|	РасшифровкаПлатежаДок.Ссылка.Дата КАК Период,
	|	РасшифровкаПлатежаДок.Ссылка.Организация КАК Организация,
	|	РасшифровкаПлатежаДок.Сделка КАК Сделка,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА &ВидОперации_Подотчетник
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.ПодотчетноеЛицо
	|		ИНАЧЕ РасшифровкаПлатежаДок.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &ВидОперации_Подотчетник
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	РасшифровкаПлатежаДок.ДокументПланированияПлатежа КАК ЗаявкаНаРасходование,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов КАК Валюта,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	СУММА(РасшифровкаПлатежаДок.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	СУММА(РасшифровкаПлатежаДок.СуммаПлатежа) КАК Сумма,
	|	0 КАК СуммаУпр,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ КАК ДатаКурса
	|ПОМЕСТИТЬ ДокументуатПлатежноеПоручениеИсходящее
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка
	|	И РасшифровкаПлатежаДок.ДокументПланированияПлатежа ССЫЛКА Документ.уатЗаявкаНаРасходованиеДС
	|	И РасшифровкаПлатежаДок.ДокументПланированияПлатежа <> ЗНАЧЕНИЕ(Документ.уатЗаявкаНаРасходованиеДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасшифровкаПлатежаДок.Ссылка,
	|	РасшифровкаПлатежаДок.Сделка,
	|	РасшифровкаПлатежаДок.ДокументПланированияПлатежа,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА &ВидОперации_Подотчетник
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДоговорКонтрагента
	|	КОНЕЦ,
	|	РасшифровкаПлатежаДок.Ссылка.Дата,
	|	РасшифровкаПлатежаДок.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА &ВидОперации_Подотчетник
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.ПодотчетноеЛицо
	|		ИНАЧЕ РасшифровкаПлатежаДок.Ссылка.Контрагент
	|	КОНЕЦ,
	|	РасшифровкаПлатежаДок.Ссылка,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежаДок.ДатаКурса = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РасшифровкаПлатежаДок.Ссылка.Дата
	|		ИНАЧЕ РасшифровкаПлатежаДок.ДатаКурса
	|	КОНЕЦ,
	|	РасшифровкаПлатежаДок.ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ЗаявкиНаРасходованиеДС"" КАК ИмяРегистра,
	|	РасшифровкаПлатежаДок.Регистратор КАК Регистратор,
	|	РасшифровкаПлатежаДок.ДокументДвижения КАК ДокументДвижения,
	|	РасшифровкаПлатежаДок.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РасшифровкаПлатежаДок.Организация КАК Организация,
	|	РасшифровкаПлатежаДок.Сделка КАК Сделка,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	РасшифровкаПлатежаДок.Контрагент КАК Контрагент,
	|	РасшифровкаПлатежаДок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РасшифровкаПлатежаДок.ЗаявкаНаРасходование КАК ЗаявкаНаРасходование,
	|	РасшифровкаПлатежаДок.ЗаявкаНаРасходование.ВалютаДокумента КАК ВалютаЗаявки,
	|	РасшифровкаПлатежаДок.ЗаявкаНаРасходование.КурсДокумента КАК КурсЗаявки,
	|	РасшифровкаПлатежаДок.ЗаявкаНаРасходование.КратностьДокумента КАК КратностьЗаявки,
	|	РасшифровкаПлатежаДок.Сумма КАК Сумма,
	|	РасшифровкаПлатежаДок.Валюта КАК Валюта,
	|	РасшифровкаПлатежаДок.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РасшифровкаПлатежаДок.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.Сумма КАК СуммаУпр,
	|	РасшифровкаПлатежаДок.ДатаКурса КАК ДатаКурса
	|ИЗ
	|	ДокументуатПлатежноеПоручениеИсходящее КАК РасшифровкаПлатежаДок");
		
	Запрос.УстановитьПараметр("Ссылка",             ДокументСсылка);
	Запрос.УстановитьПараметр("ВидОперации_Подотчетник", ВидОперации_Подотчетник);
	Запрос.УстановитьПараметр("ВидОперации_ПодотчетникИлиПрочее", ВидОперации_ПодотчетникИлиПрочее);
	Запрос.УстановитьПараметр("КурсДокумента",      СтруктураДополнительныеСвойства.КурсДокумента);
	Запрос.УстановитьПараметр("КратностьДокумента", СтруктураДополнительныеСвойства.КратностьДокумента);
	Запрос.УстановитьПараметр("ПериодОстатки",      ДокументСсылка.Дата);
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// взаиморасчеты
	ТаблицаВзаиморасчетов = МассивРезультатов[0].Выгрузить();
	Для Каждого ТекСтрока Из ТаблицаВзаиморасчетов Цикл
		Если ДокументСсылка.ВалютаДокумента = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
			ТекСтрока.СуммаУпр = ТекСтрока.СуммаПлатежа;
		ИначеЕсли ТекСтрока.Валюта = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
			ТекСтрока.СуммаУпр = ТекСтрока.СуммаВзаиморасчетов;
		Иначе
			СтруктураКурсУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
				СтруктураДополнительныеСвойства.ВалютаУпрУчета, ТекСтрока.ДатаКурса, ДокументСсылка);
				
			ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов,
				ТекСтрока.Валюта,                  СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				ТекСтрока.КурсВзаиморасчетов,      СтруктураКурсУпр.Курс,
				ТекСтрока.КратностьВзаиморасчетов, СтруктураКурсУпр.Кратность,,
				ДокументСсылка);
		КонецЕсли;
	КонецЦикла;
	//ТабВзаиморасчетов.Свернуть("ВидДвижения, Период, Регистратор, ДоговорКонтрагента, Сделка, Организация, Контрагент, Валюта", "СуммаВзаиморасчетов, СуммаУпр");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетов", ТаблицаВзаиморасчетов);
	
	// ДДС
	ТаблицаДвижениеДС = МассивРезультатов[1].Выгрузить();
	Для Каждого ТекСтрока Из ТаблицаДвижениеДС Цикл
		Если СтруктураДополнительныеСвойства.ВалютаУпрУчета = ДокументСсылка.ВалютаДокумента Тогда
			ТекСтрока.СуммаУпр = ТекСтрока.Сумма;
		ИначеЕсли флЕстьВзаиморасчеты Тогда
			Если ТекСтрока.ВалютаВзаиморасчетов = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
				ТекСтрока.СуммаУпр = ТекСтрока.СуммаВзаиморасчетов;
			Иначе
				СтруктураКурсУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
					СтруктураДополнительныеСвойства.ВалютаУпрУчета, ТекСтрока.ДатаКурса, ДокументСсылка);
					
				ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов,
					ТекСтрока.ВалютаВзаиморасчетов,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
					ТекСтрока.КурсВзаиморасчетов,      СтруктураКурсУпр.Курс,
					ТекСтрока.КратностьВзаиморасчетов, СтруктураКурсУпр.Кратность,,
					ДокументСсылка);
			КонецЕсли;
		Иначе
			ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
				ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
				СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
				ДокументСсылка);
		КонецЕсли;
	КонецЦикла;
	//ТаблицаДвижениеДС.Свернуть("ВидДвижения, Период, Регистратор, Валюта, БанковскийСчетКасса, ВидДенежныхСредств, ПриходРасход, СтатьяДвиженияДенежныхСредств, ДокументДвижения, Контрагент, ДоговорКонтрагента, Сделка, Организация","Сумма, СуммаУпр");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДвижениеДС", ТаблицаДвижениеДС);
	
	// Остатки ДС	
	ТаблицаОстаткиДС = МассивРезультатов[2].Выгрузить();
	Для Каждого ТекСтрока Из ТаблицаОстаткиДС Цикл
		Если СтруктураДополнительныеСвойства.ВалютаУпрУчета = ДокументСсылка.ВалютаДокумента Тогда
			ТекСтрока.СуммаУпр = ТекСтрока.Сумма;
		ИначеЕсли флЕстьВзаиморасчеты Тогда
			Если ТекСтрока.ВалютаВзаиморасчетов = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
				ТекСтрока.СуммаУпр = ТекСтрока.СуммаВзаиморасчетов;
			Иначе
				СтруктураКурсУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
					СтруктураДополнительныеСвойства.ВалютаУпрУчета, ТекСтрока.ДатаКурса, ДокументСсылка);
					
				ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов,
					ТекСтрока.ВалютаВзаиморасчетов,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
					ТекСтрока.КурсВзаиморасчетов,      СтруктураКурсУпр.Курс,
					ТекСтрока.КратностьВзаиморасчетов, СтруктураКурсУпр.Кратность,,
					ДокументСсылка);
			КонецЕсли;
		Иначе
			ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
				ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
				СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
				ДокументСсылка);
		КонецЕсли;		
	КонецЦикла;
	//ТаблицаОстаткиДС.Свернуть("ВидДвижения, Период, Регистратор, Организация, БанковскийСчетКасса, ВидДенежныхСредств, СтатьяДвиженияДенежныхСредств", "Сумма, СуммаУпр");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиДС", ТаблицаОстаткиДС);
	
	// Остатки ДС у подотчетных лиц
	Если ВидОперации_Подотчетник Тогда
		ТаблицаОстаткиДСУПодотчетныхЛиц = МассивРезультатов[3].Выгрузить();
		Для Каждого ТекСтрока Из ТаблицаОстаткиДСУПодотчетныхЛиц Цикл
			Если СтруктураДополнительныеСвойства.ВалютаУпрУчета = ДокументСсылка.ВалютаДокумента Тогда
				ТекСтрока.СуммаУпр = ТекСтрока.Сумма;
			Иначе
				ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
					ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
					СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
					СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
					ДокументСсылка);
			КонецЕсли;
		КонецЦикла;
		//ТаблицаОстаткиДСУПодотчетныхЛиц.Свернуть("ВидДвижения, Период, Регистратор, Организация, ПодотчетноеЛицо, Валюта", "Сумма, СуммаУпр");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиДСУПодотчетныхЛиц", ТаблицаОстаткиДСУПодотчетныхЛиц);
	КонецЕсли;
	
	// Платежный календарь
	ТаблицаПлатежныйКалендарь = МассивРезультатов[4].Выгрузить();
	ТаблицаПлатежныйКалендарьРезультат = ТаблицаПлатежныйКалендарь.Скопировать();
	ТаблицаПлатежныйКалендарьРезультат.Очистить();
	Для Каждого ТекСтрока Из ТаблицаПлатежныйКалендарь Цикл
		ОстатокПлатежа = ТекСтрока.СуммаПлатежа;
		ОстатокРасход  = ТекСтрока.СуммаРасход;
		
		Если ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			
			мсвСтрокЗаказы = ДокументСсылка.Заказы.НайтиСтроки(Новый Структура("ID", ТекСтрока.ID));
			Для Каждого ТекСтрокаЗаказ Из мсвСтрокЗаказы Цикл
				НоваяСтрокаРезультат = ТаблицаПлатежныйКалендарьРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРезультат, ТекСтрока);
				НоваяСтрокаРезультат.ЗаказНаТС = ТекСтрокаЗаказ.ЗаказНаТС;
				НоваяСтрокаРезультат.СуммаРасход = ТекСтрокаЗаказ.СуммаВзаиморасчетов;
				Если СтруктураДополнительныеСвойства.ВалютаУпрУчета = ДокументСсылка.ВалютаДокумента Тогда
					НоваяСтрокаРезультат.СуммаРасходУпр = ТекСтрокаЗаказ.СуммаПлатежа;
				ИначеЕсли ТекСтрока.Валюта = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
					НоваяСтрокаРезультат.СуммаРасходУпр = ТекСтрокаЗаказ.СуммаВзаиморасчетов;
				Иначе
					СтруктураКурсУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
						СтруктураДополнительныеСвойства.ВалютаУпрУчета, ТекСтрока.ДатаКурса, ДокументСсылка);
					
					НоваяСтрокаРезультат.СуммаРасходУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
						ТекСтрокаЗаказ.СуммаВзаиморасчетов,
						ТекСтрока.Валюта,                  СтруктураДополнительныеСвойства.ВалютаУпрУчета,
						ТекСтрока.КурсВзаиморасчетов,      СтруктураКурсУпр.Курс,
						ТекСтрока.КратностьВзаиморасчетов, СтруктураКурсУпр.Кратность,,
						ДокументСсылка);
				КонецЕсли;
				
				ОстатокПлатежа = ОстатокПлатежа - ТекСтрокаЗаказ.СуммаПлатежа;
				ОстатокРасход = ОстатокРасход - ТекСтрокаЗаказ.СуммаВзаиморасчетов;
			КонецЦикла;
		КонецЕсли;	
		
		Если ОстатокПлатежа = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаРезультат = ТаблицаПлатежныйКалендарьРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРезультат, ТекСтрока);
		НоваяСтрокаРезультат.СуммаРасход = ОстатокРасход;
		
		Если СтруктураДополнительныеСвойства.ВалютаУпрУчета = ДокументСсылка.ВалютаДокумента Тогда
			НоваяСтрокаРезультат.СуммаРасходУпр = ОстатокПлатежа;
		ИначеЕсли ТекСтрока.Валюта = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
			НоваяСтрокаРезультат.СуммаРасходУпр = ОстатокРасход;
		Иначе
			СтруктураКурсУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
				СтруктураДополнительныеСвойства.ВалютаУпрУчета, ТекСтрока.ДатаКурса, ДокументСсылка);
						
			НоваяСтрокаРезультат.СуммаРасходУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ОстатокРасход,
				ТекСтрока.Валюта,                  СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				ТекСтрока.КурсВзаиморасчетов,      СтруктураКурсУпр.Курс,
				ТекСтрока.КратностьВзаиморасчетов, СтруктураКурсУпр.Кратность,,
				ДокументСсылка);
		КонецЕсли;
	КонецЦикла;
	ТаблицаПлатежныйКалендарьРезультат.Свернуть("Период, Регистратор, Организация, Контрагент, ДоговорКонтрагента, Сделка, ЗаказНаТС, Валюта, ПолучательУслуг", "СуммаРасход, СуммаРасходУпр");
	уатПроведение_проф.РаспределитьПлатежныйКалендарьПоГрафикуОплаты(ТаблицаПлатежныйКалендарьРезультат, ДокументСсылка);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТаблицаПлатежныйКалендарьРезультат);
	
	// Заявки на расходование ДС
	ТаблицаЗаявокНаРасходованиеДС = МассивРезультатов[6].Выгрузить();
	Для Каждого ТекСтрока Из ТаблицаЗаявокНаРасходованиеДС Цикл
		//Если ДокументСсылка.ВалютаДокумента <> СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
		//	ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
		//		ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
		//		СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
		//		СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
		//		Новый Структура("Документ, ДатаКурса", ДокументСсылка, СтруктураДополнительныеСвойства.ДатаКурса));
		//КонецЕсли;
		//Если ДокументСсылка.ВалютаДокумента <> ТекСтрока.ВалютаЗаявки Тогда
		//	ТекСтрока.Сумма = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
		//		ДокументСсылка.ВалютаДокумента,                     ТекСтрока.ВалютаЗаявки,
		//		СтруктураДополнительныеСвойства.КурсДокумента,      ТекСтрока.КурсЗаявки,
		//		СтруктураДополнительныеСвойства.КратностьДокумента, ТекСтрока.КратностьЗаявки,,
		//		Новый Структура("Документ, ДатаКурса", ДокументСсылка, СтруктураДополнительныеСвойства.ДатаКурса));
		//	ТекСтрока.СуммаВзаиморасчетов = ТекСтрока.Сумма;
		//КонецЕсли;
		
		Если СтруктураДополнительныеСвойства.ВалютаУпрУчета = ДокументСсылка.ВалютаДокумента Тогда
			ТекСтрока.СуммаУпр = ТекСтрока.Сумма;
		ИначеЕсли флЕстьВзаиморасчеты Тогда
			Если ТекСтрока.ВалютаВзаиморасчетов = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
				ТекСтрока.СуммаУпр = ТекСтрока.СуммаВзаиморасчетов;
			Иначе
				СтруктураКурсУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
					СтруктураДополнительныеСвойства.ВалютаУпрУчета, ТекСтрока.ДатаКурса, ДокументСсылка);
					
				ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов,
					ТекСтрока.ВалютаВзаиморасчетов,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
					ТекСтрока.КурсВзаиморасчетов,      СтруктураКурсУпр.Курс,
					ТекСтрока.КратностьВзаиморасчетов, СтруктураКурсУпр.Кратность,,
					ДокументСсылка);
			КонецЕсли;
		Иначе
			ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
				ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
				СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
				ДокументСсылка);
		КонецЕсли;
		Если ДокументСсылка.ВалютаДокумента <> ТекСтрока.ВалютаЗаявки Тогда
			Если флЕстьВзаиморасчеты Тогда
				Если ТекСтрока.ВалютаВзаиморасчетов = ТекСтрока.ВалютаЗаявки Тогда
					ТекСтрока.Сумма = ТекСтрока.СуммаВзаиморасчетов;
				Иначе
					ТекСтрока.Сумма = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов,
						ТекСтрока.ВалютаВзаиморасчетов,    ТекСтрока.ВалютаЗаявки,
						ТекСтрока.КурсВзаиморасчетов,      ТекСтрока.КурсЗаявки,
						ТекСтрока.КратностьВзаиморасчетов, ТекСтрока.КратностьЗаявки,,
						ДокументСсылка);
				КонецЕсли;
			Иначе
				ТекСтрока.Сумма = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
					ДокументСсылка.ВалютаДокумента,                     ТекСтрока.ВалютаЗаявки,
					СтруктураДополнительныеСвойства.КурсДокумента,      ТекСтрока.КурсЗаявки,
					СтруктураДополнительныеСвойства.КратностьДокумента, ТекСтрока.КратностьЗаявки,,
					ДокументСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//ТаблицаЗаявокНаРасходованиеДС.Свернуть("ВидДвижения, Период, Регистратор, ДоговорКонтрагента, ЗаявкаНаРасходование, Контрагент, Организация, Сделка, СтатьяДвиженияДенежныхСредств", "Сумма, СуммаВзаиморасчетов, СуммаУпр");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаявокНаРасходованиеДС", ТаблицаЗаявокНаРасходованиеДС);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры

// Получает дополнительные реквизиты для отображения в отчете "Реестр документов"
// 
// Возвращаемое значение:
//  Структура - доп. реквизитов
//
Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Контрагент");
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПечатьППИсх(МассивОбъектов, ОбъектыПечати)  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ППИсходящее";
	
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПП", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПлатежноеПоручениеИсходящее.Ссылка КАК Ссылка,
	|	уатПлатежноеПоручениеИсходящее.Организация КАК Организация,
	|	уатПлатежноеПоручениеИсходящее.Номер КАК Номер,
	|	уатПлатежноеПоручениеИсходящее.БанковскийСчет КАК БанковскийСчет,
	|	уатПлатежноеПоручениеИсходящее.Дата КАК Дата,
	|	уатПлатежноеПоручениеИсходящее.ВидПлатежа КАК ВидПлатежа,
	|	уатПлатежноеПоручениеИсходящее.СуммаДокумента КАК СуммаДокумента,
	|	уатПлатежноеПоручениеИсходящее.Контрагент КАК Контрагент,
	|	уатПлатежноеПоручениеИсходящее.СчетКонтрагента КАК СчетКонтрагента,
	|	уатПлатежноеПоручениеИсходящее.ОчередностьПлатежа КАК ОчередностьПлатежа,
	|	уатПлатежноеПоручениеИсходящее.НазначениеПлатежа КАК НазначениеПлатежа,
	|	уатПлатежноеПоручениеИсходящее.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	уатПлатежноеПоручениеИсходящее.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.уатПлатежноеПоручениеИсходящее КАК уатПлатежноеПоручениеИсходящее
	|ГДЕ
	|	уатПлатежноеПоручениеИсходящее.Ссылка В(&МассивПП)";
		
	ДокументПП = Запрос.Выполнить().Выбрать();
	
	Пока ДокументПП.Следующий() Цикл 
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ППИсходящее";
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ПлатежноеПоручение");
		
		Если Не ЗначениеЗаполнено(ДокументПП.Организация) Тогда
			ТекстНСТР = НСтр("en='Company is not specified in payment order ""%1""!';ru='Не указана организация в платежном поручении ""%1""!'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, ДокументПП.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			Прервать;
		КонецЕсли;
		
		ПечатьПрефиксовВключена = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументПП.Организация, ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ВыводитьПрефиксПриПечати"));
		Если ПечатьПрефиксовВключена Тогда
			НомерПечать = ДокументПП.Номер;
		Иначе 
			НомерПечать = уатОбщегоНазначенияКлиентСервер.НомерДокументаНаПечать(ДокументПП.Номер, Истина, Истина);
		КонецЕсли;
		
		Если Прав(НомерПечать, 3)="000" Тогда
			ТекстНСТР = НСтр("en='Payment order number ""%1"" can not end with ""000""!';ru='Номер платежного поручения ""%1"" не может оканчиваться на ""000""!'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, ДокументПП.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			Возврат Неопределено;
		КонецЕсли;
		
		Обл = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		
		МесяцПрописью   = ДокументПП.БанковскийСчет.МесяцПрописью;
		СуммаБезКопеек  = ДокументПП.БанковскийСчет.СуммаБезКопеек;
		ФорматДаты      = "ДФ=" + ?(МесяцПрописью = 1,"'дд ММММ гггг'","'дд.ММ.гггг'");
		БанкОрганизации = ?(НЕ ЗначениеЗаполнено(ДокументПП.БанковскийСчет.БанкДляРасчетов), ДокументПП.БанковскийСчет.Банк, 
			ДокументПП.БанковскийСчет.БанкДляРасчетов);
		БанкКонтрагента = ?(НЕ ЗначениеЗаполнено(ДокументПП.СчетКонтрагента.БанкДляРасчетов), ДокументПП.СчетКонтрагента.Банк, 
			ДокументПП.СчетКонтрагента.БанкДляРасчетов);
		
		Обл.Параметры.НаименованиеНомер       = НСтр("en='PAYMENT ORDER №';ru='ПЛАТЕЖНОЕ ПОРУЧЕНИЕ № '") + НомерПечать;
		Обл.Параметры.ДатаДокумента           = Формат(ДокументПП.Дата, ФорматДаты);
		Обл.Параметры.ВидПлатежа              = ДокументПП.ВидПлатежа;
		Обл.Параметры.СуммаЧислом             = ФорматироватьСумму(ДокументПП.СуммаДокумента, СуммаБезКопеек);
		Обл.Параметры.СуммаПрописью           = ФорматироватьСуммуПрописи(ДокументПП.СуммаДокумента, СуммаБезКопеек, ДокументПП.БанковскийСчет);
		
		Обл.Параметры.ПлательщикИНН                = "ИНН " + ДокументПП.Организация.ИНН;
		Обл.Параметры.ПлательщикКПП                = "КПП " + ДокументПП.Организация.КПП;
		Обл.Параметры.Плательщик                   = ДокументПП.Организация.НаименованиеПолное;
		Обл.Параметры.БанкПлательщика              = "" + БанкОрганизации + " " + БанкОрганизации.Город;
		Обл.Параметры.БанкПолучателя               = "" + БанкКонтрагента + " " + БанкКонтрагента.Город;
		Обл.Параметры.ПолучательИНН                = "ИНН " + ДокументПП.Контрагент.ИНН;
		Обл.Параметры.ПолучательКПП                = "КПП " + 
			уатОбщегоНазначенияСервер.ПолучитьАктуальныйКПП("Контрагенты", ДокументПП.Дата, ДокументПП.Контрагент);
		Обл.Параметры.Получатель                   = ДокументПП.Контрагент.НаименованиеПолное;
		
		
		Обл.Параметры.ИдентификаторПлатежа = ДокументПП.ИдентификаторПлатежа;
		
		Если ТипЗнч(ДокументПП.ДокументОснование) = Тип("ДокументСсылка.уатШтраф") Тогда
			Обл.Параметры.КодБК = ?(ЗначениеЗаполнено(ДокументПП.ДокументОснование.КодБК), ДокументПП.ДокументОснование.КодБК,
				ДокументПП.Контрагент.КБК);
			
			Обл.Параметры.КодОКАТО = ?(ЗначениеЗаполнено(ДокументПП.ДокументОснование.КодПоОКТМО), ДокументПП.ДокументОснование.КодПоОКТМО,
				ДокументПП.Контрагент.КодПоОКТМО);
				
			Если НЕ ЗначениеЗаполнено(ДокументПП.ИдентификаторПлатежа) Тогда // для старых документов, когда не было ИдентификаторПлатежа в ППИ
				Обл.Параметры.ИдентификаторПлатежа = ДокументПП.ДокументОснование.НомерПостановления;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументПП.БанковскийСчет.БанкДляРасчетов) Тогда
			СтрКорреспондент = "";
		Иначе
			СтрКорреспондент = " р/с " + ДокументПП.БанковскийСчет.НомерСчета+ " в " + ДокументПП.БанковскийСчет.Банк + " " 
				+ ДокументПП.БанковскийСчет.Банк.Город;
		КонецЕсли;
		
		Обл.Параметры.НомерСчетаПлательщика   = ВернутьРасчетныйСчет(ДокументПП.БанковскийСчет);
		Обл.Параметры.БикБанкаПлательщика     = БанкОрганизации.Код;
		Обл.Параметры.СчетБанкаПлательщика    = БанкОрганизации.КоррСчет;
		
		Обл.Параметры.БикБанкаПолучателя      = БанкКонтрагента.Код;
		Обл.Параметры.СчетБанкаПолучателя     = БанкКонтрагента.КоррСчет;
		Обл.Параметры.НомерСчетаПолучателя    = ВернутьРасчетныйСчет(ДокументПП.СчетКонтрагента);
		
		Обл.Параметры.НазначениеПлатежа       = СокрЛП(ДокументПП.НазначениеПлатежа);
		Обл.Параметры.Очередность             = ДокументПП.ОчередностьПлатежа;
		Обл.Параметры.СрокПлатежа             = "";
		
		ТабличныйДокумент.Вывести(Обл);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДокументПП.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Форматирует сумму прописью документа
//
// Параметры:
//  СуммаДок - число - реквизит, который надо представить прописью 
//  СуммаБезКопеек - булево - флаг представления суммы без копеек
//
// Возвращаемое значение
//  Отформатированную строку
//
Функция ФорматироватьСуммуПрописи(СуммаДок, СуммаБезКопеек, БанковскийСчет)
	
	Результат     = СуммаДок;
	ЦелаяЧасть    = Цел(СуммаДок);
	ФорматСтрока  = "Л=ru_RU; ДП=Ложь";
	ПарамПредмета = БанковскийСчет.ВалютаДенежныхСредств.ПараметрыПрописи;
	
	Если (Результат - ЦелаяЧасть) = 0 Тогда
		Если СуммаБезКопеек Тогда
			Результат = ЧислоПрописью(Результат,ФорматСтрока,ПарамПредмета);
			Результат = Лев(Результат,Найти(Результат,"0")-1);
		Иначе
			Результат = ЧислоПрописью(Результат,ФорматСтрока,ПарамПредмета);
		КонецЕсли;
	Иначе
		Результат = ЧислоПрописью(Результат,ФорматСтрока,ПарамПредмета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСуммуПрописи()

// Форматирует сумму  документа
//
// Параметры:
//  СуммаДок - число - реквизит, который надо отформатировать
//  СуммаБезКопеек - булево - флаг представления суммы без копеек
//
// Возвращаемое значение
//  Отформатированную строку
//
Функция ФорматироватьСумму(СуммаДок,СуммаБезКопеек)
	
	Результат  = СуммаДок;
	ЦелаяЧасть = Цел(СуммаДок);
	
	Если (Результат - ЦелаяЧасть) = 0 Тогда
		Если СуммаБезКопеек Тогда
			Результат = Формат(Результат,"ЧДЦ=2; ЧРД='='; ЧГ=0");
			Результат = Лев(Результат,Найти(Результат,"="));
		Иначе
			Результат = Формат(Результат,"ЧДЦ=2; ЧРД='-'; ЧГ=0");
		КонецЕсли;
	Иначе
		Результат = Формат(Результат,"ЧДЦ=2; ЧРД='-'; ЧГ=0");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСумму()

// Определяет номер расчетного счета по
// переданному банковскому счету
//
// Параметры:
//  СчетКонтра - справочник.БанковскиеСчета
//
// Возвращаемое значение
//  Номер расчетного счета
//
Функция ВернутьРасчетныйСчет(СчетКонтрагента)
	
	БанкДляРасчетов = СчетКонтрагента.БанкДляРасчетов;
	Результат       = ?(Не ЗначениеЗаполнено(БанкДляРасчетов), СчетКонтрагента.НомерСчета, СчетКонтрагента.Банк.КоррСчет);
	
	Возврат Результат;
	
КонецФункции // ВернутьРасчетныйСчет()

// Процедура - Заполнить структуру получателей печатных форм
//
// Параметры:
//  СтруктураДанныхОбъектаПечати - Структура - Структура данных получателей печатной формы
//
Процедура ЗаполнитьСтруктуруПолучателейПечатныхФорм(СтруктураДанныхОбъектаПечати) Экспорт
	
	СтруктураДанныхОбъектаПечати.ОсновнойПолучатель = "Контрагент";
	 
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("Контрагент");
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("ПодотчетноеЛицо");
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("КонтактноеЛицо");
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("Грузоотправитель");
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("Грузополучатель");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
